wosayttn/Gerrit_NuMicro/M2003xC_M2003xD_M2003xE_M2003xG_Series/Library/Device/Nuvoton/M2003/Include/uuart_reg.h
/**************************************************************************//**
 * @file     uuart_reg.h
 * @version  V1.00
 * @brief    UUART register definition header file
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/
#ifndef __UUART_REG_H__
#define __UUART_REG_H__

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

/** @addtogroup REGISTER Control Register

  @{

*/

/*---------------------- UART Mode of USCI Controller -------------------------*/
/**
    @addtogroup UUART UART Mode of USCI Controller (UUART)
    Memory Mapped Structure for UUART Controller
@{ */
 
typedef struct
{


/**
 * @var UUART_T::CTL
 * Offset: 0x00  USCI Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[2:0]   |FUNMODE   |Function Mode
 * |        |          |This bit field selects the protocol for this USCI controller
 * |        |          |Selecting a protocol that is not available or a reserved combination disables the USCI
 * |        |          |When switching between two protocols, the USCI has to be disabled before selecting a new protocol
 * |        |          |Simultaneously, the USCI will be reset when user write 000 to FUNMODE.
 * |        |          |000 = The USCI is disabled. All protocol related state machines are set to idle state.
 * |        |          |001 = The SPI protocol is selected.
 * |        |          |010 = The UART protocol is selected.
 * |        |          |100 = The I2C protocol is selected.
 * |        |          |Others = Reserved.
 * @var UUART_T::INTEN
 * Offset: 0x04  USCI Interrupt Enable Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[1]     |TXSTIEN   |Transmit Start Interrupt Enable Bit
 * |        |          |This bit enables the interrupt generation in case of a transmit start event.
 * |        |          |0 = The transmit start interrupt Disabled.
 * |        |          |1 = The transmit start interrupt Enabled. 
 * |[2]     |TXENDIEN  |Transmit End Interrupt Enable Bit
 * |        |          |This bit enables the interrupt generation in case of a transmit finish event.
 * |        |          |0 = The transmit finish interrupt Disabled.
 * |        |          |1 = The transmit finish interrupt Enabled. 
 * |[3]     |RXSTIEN   |Receive Start Interrupt Enable Bit
 * |        |          |This bit enables the interrupt generation in case of a receive start event.
 * |        |          |0 = The receive start interrupt Disabled.
 * |        |          |1 = The receive start interrupt Enabled. 
 * |[4]     |RXENDIEN  |Receive End Interrupt Enable Bit
 * |        |          |This bit enables the interrupt generation in case of a receive finish event.
 * |        |          |0 = The receive end interrupt Disabled.
 * |        |          |1 = The receive end interrupt Enabled. 
 * @var UUART_T::BRGEN
 * Offset: 0x08  USCI Baud Rate Generator Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |RCLKSEL   |Reference Clock Source Selection
 * |        |          |This bit selects the source signal of reference clock (fREF_CLK).
 * |        |          |0 = Peripheral device clock fPCLK.
 * |        |          |1 = Reserved.
 * |[1]     |PTCLKSEL  |Protocol Clock Source Selection
 * |        |          |This bit selects the source signal of protocol clock (fPROT_CLK).
 * |        |          |0 = Reference clock fREF_CLK.
 * |        |          |1 = fREF_CLK2 (its frequency is half of fREF_CLK).
 * |[3:2]   |SPCLKSEL  |Sample Clock Source Selection
 * |        |          |This bit field used for the clock source selection of a sample clock (fSAMP_CLK) for the protocol processor.
 * |        |          |00 = fSAMP_CLK is selected to fDIV_CLK.
 * |        |          |01 = fSAMP_CLK is selected to fPROT_CLK.
 * |        |          |10 = fSAMP_CLK is selected to fSCLK.
 * |        |          |11 = fSAMP_CLK is selected to fREF_CLK.
 * |[4]     |TMCNTEN   |Timing Measurement Counter Enable Bit
 * |        |          |This bit enables the 10-bit timing measurement counter.
 * |        |          |0 = Timing measurement counter is Disabled.
 * |        |          |1 = Timing measurement counter is Enabled.
 * |[5]     |TMCNTSRC  |Timing Measurement Counter Clock Source Selection
 * |        |          |0 = Timing measurement counter with fPROT_CLK.
 * |        |          |1 = Timing measurement counter with fDIV_CLK.
 * |[9:8]   |PDSCNT    |Pre-divider for Sample Counter
 * |        |          |This bit field defines the divide ratio of the clock division from sample clock fSAMP_CLK
 * |        |          |The divided frequency fPDS_CNT = fSAMP_CLK / (PDSCNT+1).
 * |[14:10] |DSCNT     |Denominator for Sample Counter
 * |        |          |This bit field defines the divide ratio of the sample clock fSAMP_CLK.
 * |        |          |The divided frequency fDS_CNT = fPDS_CNT / (DSCNT+1).
 * |        |          |Note: The maximum value of DSCNT is 0xF on UART mode and suggest to set over 4 to confirm the receiver data is sampled in right value
 * |[25:16] |CLKDIV    |Clock Divider
 * |        |          |This bit field defines the ratio between the protocol clock frequency fPROT_CLK and the clock divider frequency fDIV_CLK (fDIV_CLK = fPROT_CLK / (CLKDIV+1) ).
 * |        |          |Note: In UART function, it can be updated by hardware in the 4th falling edge of the input data 0x55 when the auto baud rate function (ABREN(UUART_PROTCTL[6])) is enabled
 * |        |          |The revised value is the average bit time between bit 5 and bit 6
 * |        |          |The user can use revised CLKDIV and new BRDETITV (UUART_PROTCTL[24:16]) to calculate the precise baud rate.
 * @var UUART_T::DATIN0
 * Offset: 0x10  USCI Input Data Signal Configuration Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |SYNCSEL   |Input Signal Synchronization Selection
 * |        |          |This bit selects if the un-synchronized input signal (with optionally inverted) or the synchronized (and optionally filtered) signal can be used as input for the data shift unit.
 * |        |          |0 = The un-synchronized signal can be taken as input for the data shift unit.
 * |        |          |1 = The synchronized signal can be taken as input for the data shift unit.
 * |[2]     |ININV     |Input Signal Inverse Selection
 * |        |          |This bit defines the inverter enable of the input asynchronous signal.
 * |        |          |0 = The un-synchronized input signal will not be inverted.
 * |        |          |1 = The un-synchronized input signal will be inverted.
 * |[4:3]   |EDGEDET   |Input Signal Edge Detection Mode
 * |        |          |This bit field selects which edge actives the trigger event of input data signal.
 * |        |          |00 = The trigger event activation is disabled.
 * |        |          |01 = A rising edge activates the trigger event of input data signal.
 * |        |          |10 = A falling edge activates the trigger event of input data signal.
 * |        |          |11 = Both edges activate the trigger event of input data signal.
 * |        |          |Note: In UART function mode, it is suggested to set this bit field as 10.
 * @var UUART_T::CTLIN0
 * Offset: 0x20  USCI Input Control Signal Configuration Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |SYNCSEL   |Input Synchronization Signal Selection
 * |        |          |This bit selects if the un-synchronized input signal (with optionally inverted) or the synchronized (and optionally filtered) signal can be used as input for the data shift unit.
 * |        |          |0 = The un-synchronized signal can be taken as input for the data shift unit.
 * |        |          |1 = The synchronized signal can be taken as input for the data shift unit.
 * |[2]     |ININV     |Input Signal Inverse Selection
 * |        |          |This bit defines the inverter enable of the input asynchronous signal.
 * |        |          |0 = The un-synchronized input signal will not be inverted.
 * |        |          |1 = The un-synchronized input signal will be inverted.
 * @var UUART_T::CLKIN
 * Offset: 0x28  USCI Input Clock Signal Configuration Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |SYNCSEL   |Input Synchronization Signal Selection
 * |        |          |This bit selects if the un-synchronized input signal or the synchronized (and optionally filtered) signal can be used as input for the data shift unit.
 * |        |          |0 = The un-synchronized signal can be taken as input for the data shift unit.
 * |        |          |1 = The synchronized signal can be taken as input for the data shift unit.
 * @var UUART_T::LINECTL
 * Offset: 0x2C  USCI Line Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |LSB       |LSB First Transmission Selection
 * |        |          |0 = The MSB, which bit of transmit/receive data buffer depends on the setting of DWIDTH, is transmitted/received first.
 * |        |          |1 = The LSB, the bit 0 of data buffer, will be transmitted/received first.
 * |[5]     |DATOINV   |Data Output Inverse Selection
 * |        |          |This bit defines the relation between the internal shift data value and the output data signal of USCIx_DAT1 pin.
 * |        |          |0 = The value of USCIx_DAT1 is equal to the data shift register.
 * |        |          |1 = The value of USCIx_DAT1 is the inversion of data shift register.
 * |[7]     |CTLOINV   |Control Signal Output Inverse Selection
 * |        |          |This bit defines the relation between the internal control signal and the output control signal.
 * |        |          |0 = No effect.
 * |        |          |1 = The control signal will be inverted before its output.
 * |        |          |Note: In UART protocol, the control signal means nRTS signal.
 * |[11:8]  |DWIDTH    |Word Length of Transmission
 * |        |          |This bit field defines the data word length (amount of bits) for reception and transmission
 * |        |          |The data word is always right-aligned in the data buffer
 * |        |          |USCI support word length from 4 to 16 bits.
 * |        |          |0000 = The data word contains 16 bits located at bit positions [15:0].
 * |        |          |0001 = Reserved.
 * |        |          |0010 = Reserved.
 * |        |          |0011 = Reserved.
 * |        |          |0100 = The data word contains 4 bits located at bit positions [3:0].
 * |        |          |0101 = The data word contains 5 bits located at bit positions [4:0].
 * |        |          |0110 = The data word contains 6 bits located at bit positions [5:0].
 * |        |          |0111 = The data word contains 7 bits located at bit positions [6:0].
 * |        |          |1000 = The data word contains 8 bits located at bit positions [7:0].
 * |        |          |1001 = The data word contains 9 bits located at bit positions [8:0].
 * |        |          |1010 = The data word contains 10 bits located at bit positions [9:0].
 * |        |          |1011 = The data word contains 11 bits located at bit positions [10:0].
 * |        |          |1100 = The data word contains 12 bits located at bit positions [11:0].
 * |        |          |1101 = The data word contains 13 bits located at bit positions [12:0].
 * |        |          |1110 = The data word contains 14 bits located at bit positions [13:0].
 * |        |          |1111 = The data word contains 15 bits located at bit positions [14:0].
 * |        |          |Note: In UART protocol, the length can be configured as 6~13 bits.
 * @var UUART_T::TXDAT
 * Offset: 0x30  USCI Transmit Data Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |TXDAT     |Transmit Data
 * |        |          |Software can use this bit field to write 16-bit transmit data for transmission.
 * @var UUART_T::RXDAT
 * Offset: 0x34  USCI Receive Data Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |RXDAT     |Received Data
 * |        |          |This bit field monitors the received data which stored in receive data buffer.
 * |        |          |Note: RXDAT[15:13] indicate the same frame status of BREAK, FRMERR and PARITYERR (UUART_PROTSTS[7:5]).
 * @var UUART_T::BUFCTL
 * Offset: 0x38  USCI Transmit/Receive Buffer Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7]     |TXCLR     |Clear Transmit Buffer
 * |        |          |0 = No effect.
 * |        |          |1 = The transmit buffer is cleared (filling level is cleared and output pointer is set to input pointer value)
 * |        |          |Should only be used while the buffer is not taking part in data traffic.
 * |        |          |Note: It is cleared automatically after one PCLK cycle.
 * |[14]    |RXOVIEN   |Receive Buffer Overrun Error Interrupt Enable Bit
 * |        |          |0 = Receive overrun interrupt Disabled.
 * |        |          |1 = Receive overrun interrupt Enabled.
 * |[15]    |RXCLR     |Clear Receive Buffer
 * |        |          |0 = No effect.
 * |        |          |1 = The receive buffer is cleared (filling level is cleared and output pointer is set to input pointer value)
 * |        |          |Should only be used while the buffer is not taking part in data traffic.
 * |        |          |Note: It is cleared automatically after one PCLK cycle.
 * |[16]    |TXRST     |Transmit Reset
 * |        |          |0 = No effect.
 * |        |          |1 = Reset the transmit-related counters, state machine, and the content of transmit shift register and data buffer.
 * |        |          |Note: It is cleared automatically after one PCLK cycle.
 * |[17]    |RXRST     |Receive Reset
 * |        |          |0 = No effect.
 * |        |          |1 = Reset the receive-related counters, state machine, and the content of receive shift register and data buffer.
 * |        |          |Note 1: It is cleared automatically after one PCLK cycle.
 * |        |          |Note 2: It is suggested to check the RXBUSY (UUART_PROTSTS[10]) before this bit will be set to 1.
 * @var UUART_T::BUFSTS
 * Offset: 0x3C  USCI Transmit/Receive Buffer Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |RXEMPTY   |Receive Buffer Empty Indicator
 * |        |          |0 = Receive buffer is not empty.
 * |        |          |1 = Receive buffer is empty.
 * |[1]     |RXFULL    |Receive Buffer Full Indicator
 * |        |          |0 = Receive buffer is not full.
 * |        |          |1 = Receive buffer is full.
 * |[3]     |RXOVIF    |Receive Buffer Over-run Error Interrupt Status
 * |        |          |This bit indicates that a receive buffer overrun error event has been detected
 * |        |          |If RXOVIEN (UUART_BUFCTL[14]) is enabled, the corresponding interrupt request is activated
 * |        |          |It is cleared by software writes 1 to this bit.
 * |        |          |0 = A receive buffer overrun error event has not been detected.
 * |        |          |1 = A receive buffer overrun error event has been detected.
 * |[8]     |TXEMPTY   |Transmit Buffer Empty Indicator
 * |        |          |0 = Transmit buffer is not empty.
 * |        |          |1 = Transmit buffer is empty.
 * |[9]     |TXFULL    |Transmit Buffer Full Indicator
 * |        |          |0 = Transmit buffer is not full.
 * |        |          |1 = Transmit buffer is full.
 * @var UUART_T::PDMACTL
 * Offset: 0x40  USCI PDMA Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |PDMARST   |PDMA Reset
 * |        |          |0 = No effect.
 * |        |          |1 = Reset the USCI's PDMA control logic. This bit will be cleared to 0 automatically.
 * |[1]     |TXPDMAEN  |PDMA Transmit Channel Available
 * |        |          |0 = Transmit PDMA function Disabled.
 * |        |          |1 = Transmit PDMA function Enabled.
 * |[2]     |RXPDMAEN  |PDMA Receive Channel Available
 * |        |          |0 = Receive PDMA function Disabled.
 * |        |          |1 = Receive PDMA function Enabled.
 * |[3]     |PDMAEN    |PDMA Mode Enable Bit
 * |        |          |0 = PDMA function Disabled.
 * |        |          |1 = PDMA function Enabled.
 * @var UUART_T::WKCTL
 * Offset: 0x54  USCI Wake-up Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |WKEN      |Wake-up Enable Bit
 * |        |          |0 = Wake-up function Disabled.
 * |        |          |1 = Wake-up function Enabled.
 * |[2]     |PDBOPT    |Power Down Blocking Option
 * |        |          |0 = If user attempts to enter Power-down mode by executing WFI while the protocol is in transferring, MCU will stop the transfer and enter Power-down mode immediately.
 * |        |          |1 = If user attempts to enter Power-down mode by executing WFI while the protocol is in transferring, the on-going transfer will not be stopped and MCU will enter idle mode immediately.
 * @var UUART_T::WKSTS
 * Offset: 0x58  USCI Wake-up Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |WKF       |Wake-up Flag
 * |        |          |When chip is woken up from Power-down mode, this bit is set to 1
 * |        |          |Software can write 1 to clear this bit.
 * @var UUART_T::PROTCTL
 * Offset: 0x5C  USCI Protocol Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |STOPB     |Stop Bits
 * |        |          |This bit defines the number of stop bits in an UART frame.
 * |        |          |0 = The number of stop bits is 1.
 * |        |          |1 = The number of stop bits is 2.
 * |[1]     |PARITYEN  |Parity Enable Bit
 * |        |          |This bit defines the parity bit is enabled in an UART frame.
 * |        |          |0 = The parity bit Disabled.
 * |        |          |1 = The parity bit Enabled.
 * |[2]     |EVENPARITY|Even Parity Enable Bit
 * |        |          |0 = Odd number of logic 1 s is transmitted and checked in each word.
 * |        |          |1 = Even number of logic 1 s is transmitted and checked in each word.
 * |        |          |Note: This bit has effect only when PARITYEN is set.
 * |[3]     |RTSAUTOEN |nRTS Auto-flow Control Enable Bit
 * |        |          |When nRTS auto-flow is enabled, if the receiver buffer is full (RXFULL (UUART_BUFSTS[1] =1), the UART will de-assert nRTS signal.
 * |        |          |0 = nRTS auto-flow control Disabled.
 * |        |          |1 = nRTS auto-flow control Enabled.
 * |        |          |Note: This bit has effect only when the RTSAUDIREN is not set. 
 * |[4]     |CTSAUTOEN |nCTS Auto-flow Control Enable Bit
 * |        |          |When nCTS auto-flow is enabled, the UART will send data to external device when nCTS input assert (UART will not send data to device if nCTS input is dis-asserted).
 * |        |          |0 = nCTS auto-flow control Disabled.
 * |        |          |1 = nCTS auto-flow control Enabled.
 * |[5]     |RTSAUDIREN|nRTS Auto Direction Enable Bit
 * |        |          |When nRTS auto direction is enabled, if the transmitted bytes in the TX buffer is empty, the UART asserted nRTS signal automatically.
 * |        |          |0 = nRTS auto direction control Disabled.
 * |        |          |1 = nRTS auto direction control Enabled.
 * |        |          |Note 1: This bit is used for nRTS auto direction control for RS485.
 * |        |          |Note 2: This bit has effect only when the RTSAUTOEN is not set.
 * |[6]     |ABREN     |Auto-baud Rate Detect Enable Bit
 * |        |          |0 = Auto-baud rate detect function Disabled.
 * |        |          |1 = Auto-baud rate detect function Enabled.
 * |        |          |Note: When the auto - baud rate detect operation finishes, hardware will clear this bit
 * |        |          |The associated interrupt ABRDETIF (UUART_PROTST[9]) will be generated (If ARBIEN (UUART_PROTIEN [1]) is enabled).
 * |[9]     |DATWKEN   |Data Wake-up Mode Enable Bit
 * |        |          |0 = Data wake-up mode Disabled.
 * |        |          |1 = Data wake-up mode Enabled.
 * |[10]    |CTSWKEN   |nCTS Wake-up Mode Enable Bit
 * |        |          |0 = nCTS wake-up mode Disabled.
 * |        |          |1 = nCTS wake-up mode Enabled.
 * |[14:11] |WAKECNT   |Wake-up Counter
 * |        |          |These bits field indicate how many clock cycle selected by fPDS_CNT do the slave can get the 1st bit (start bit) when the device is wake-up from Power-down mode.
 * |[24:16] |BRDETITV  |Baud Rate Detection Interval
 * |        |          |This bit fields indicate how many clock cycle selected by TMCNTSRC (UUART_BRGEN [5]) does the slave calculates the baud rate in one bits
 * |        |          |The order of the bus shall be 1 and 0 step by step (e.g
 * |        |          |the input data pattern shall be 0x55)
 * |        |          |The user can read the value to know the current input baud rate of the bus whenever the ABRDETIF (UUART_PROTSTS[9]) is set.
 * |        |          |Note: This bit can be cleared to 0 by software writing '0' to the BRDETITV.
 * |[26]    |STICKEN   |Stick Parity Enable Bit
 * |        |          |0 = Stick parity Disabled.
 * |        |          |1 = Stick parity Enabled.
 * |        |          |Note: Refer to RS-485 Support section for detailed information.
 * |[29]    |BCEN      |Transmit Break Control Enable Bit
 * |        |          |0 = Transmit Break Control Disabled.
 * |        |          |1 = Transmit Break Control Enabled.
 * |        |          |Note: When this bit is set to logic 1, the serial data output (TX) is forced to the Spacing State (logic 0)
 * |        |          |This bit acts only on TX line and has no effect on the transmitter logic.
 * |[30]    |DGE       |Deglitch Enable Bit
 * |        |          |0 = Deglitch Disabled.
 * |        |          |1 = Deglitch Enabled.
