wosayttn/Gerrit_NuMicro/M2003xC_M2003xD_M2003xE_M2003xG_Series/Library/Device/Nuvoton/M2003/Include/uuart_reg.h
 * |        |          |Note 1: When this bit is set to logic 1, any pulse width less than about 150 ns will be considered a glitch and will be removed in the serial data input (RX)
 * |        |          |This bit acts only on RX line and has no effect on the transmitter logic.
 * |        |          |Note 2: It is recommended to set this bit only when operating at baud rate under 2.5 Mbps.
 * |[31]    |PROTEN    |UART Protocol Enable Bit
 * |        |          |0 = UART Protocol Disabled.
 * |        |          |1 = UART Protocol Enabled.
 * @var UUART_T::PROTIEN
 * Offset: 0x60  USCI Protocol Interrupt Enable Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[1]     |ABRIEN    |Auto-baud Rate Interrupt Enable Bit
 * |        |          |0 = Auto-baud rate interrupt Disabled.
 * |        |          |1 = Auto-baud rate interrupt Enabled.
 * |[2]     |RLSIEN    |Receive Line Status Interrupt Enable Bit
 * |        |          |0 = Receive line status interrupt Disabled.
 * |        |          |1 = Receive line status interrupt Enabled.
 * |        |          |Note: UUART_PROTSTS[7:5] indicates the current interrupt event for receive line status interrupt.
 * @var UUART_T::PROTSTS
 * Offset: 0x64  USCI Protocol Status Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[1]     |TXSTIF    |Transmit Start Interrupt Flag
 * |        |          |0 = A transmit start interrupt status has not occurred.
 * |        |          |1 = A transmit start interrupt status has occurred.
 * |        |          |Note 1: It is cleared by software writing one into this bit.
 * |        |          |Note 2: Used for user to load next transmit data when there is no data in transmit buffer.
 * |[2]     |TXENDIF   |Transmit End Interrupt Flag
 * |        |          |0 = A transmit end interrupt status has not occurred.
 * |        |          |1 = A transmit end interrupt status has occurred.
 * |        |          |Note: It is cleared by software writing 1 into this bit.
 * |[3]     |RXSTIF    |Receive Start Interrupt Flag
 * |        |          |0 = A receive start interrupt status has not occurred.
 * |        |          |1 = A receive start interrupt status has occurred.
 * |        |          |Note: It is cleared by software writing 1 into this bit. 
 * |[4]     |RXENDIF   |Receive End Interrupt Flag
 * |        |          |0 = A receive finish interrupt status has not occurred.
 * |        |          |1 = A receive finish interrupt status has occurred.
 * |        |          |Note: It is cleared by software writing 1 into this bit.
 * |[5]     |PARITYERR |Parity Error Flag
 * |        |          |This bit is set to logic 1 whenever the received character does not have a valid "parity bit".
 * |        |          |0 = No parity error is generated.
 * |        |          |1 = Parity error is generated.
 * |        |          |Note: This bit can be cleared by writing "1" among the BREAK, FRMERR and PARITYERR bits.
 * |[6]     |FRMERR    |Framing Error Flag
 * |        |          |This bit is set to logic 1 whenever the received character does not have a valid "stop bit" (that is, the stop bit following the last data bit or parity bit is detected as logic 0).
 * |        |          |0 = No framing error is generated.
 * |        |          |1 = Framing error is generated.
 * |        |          |Note: This bit can be cleared by writing "1" among the BREAK, FRMERR and PARITYERR bits.
 * |[7]     |BREAK     |Break Flag
 * |        |          |This bit is set to logic 1 whenever the received data input (RX) is held in the "spacing state" (logic 0) for longer than a full word transmission time (that is, the total time of "start bit" + data bits + parity + stop bits).
 * |        |          |0 = No Break is generated.
 * |        |          |1 = Break is generated in the receiver bus.
 * |        |          |Note: This bit can be cleared by writing "1"among the BREAK, FRMERR and PARITYERR bits.
 * |[9]     |ABRDETIF  |Auto-baud Rate Interrupt Flag
 * |        |          |This bit is set when auto-baud rate detection is done among the falling edge of the input data
 * |        |          |If the ABRIEN (UUART_PROTCTL[6]) is set, the auto-baud rate interrupt will be generated
 * |        |          |This bit can be set 4 times when the input data pattern is 0x55 and it is cleared before the next falling edge of the input bus.
 * |        |          |0 = Auto-baud rate detect function is not done.
 * |        |          |1 = One Bit auto-baud rate detect function is done.
 * |        |          |Note: This bit can be cleared by writing "1" to it. 
 * |[10]    |RXBUSY    |RX Bus Status Flag (Read Only)
 * |        |          |This bit indicates the busy status of the receiver.
 * |        |          |0 = The receiver is Idle.
 * |        |          |1 = The receiver is BUSY. 
 * |[11]    |ABERRSTS  |Auto-baud Rate Error Status
 * |        |          |This bit is set when auto-baud rate detection counter overrun
 * |        |          |When the auto-baud rate counter overrun, the user shall revise the CLKDIV (UUART_BRGEN[25:16]) value and enable ABREN (UUART_PROTCTL[6]) to detect the correct baud rate again.
 * |        |          |0 = Auto-baud rate detect counter is not overrun.
 * |        |          |1 = Auto-baud rate detect counter is overrun.
 * |        |          |Note 1: This bit is set at the same time of ABRDETIF.
 * |        |          |Note 2: This bit can be cleared by writing "1" to ABRDETIF or ABERRSTS.
 * |[16]    |CTSSYNCLV |nCTS Synchronized Level Status (Read Only)
 * |        |          |This bit used to indicate the current status of the internal synchronized nCTS signal.
 * |        |          |0 = The internal synchronized nCTS is low.
 * |        |          |1 = The internal synchronized nCTS is high.
 * |[17]    |CTSLV     |nCTS Pin Status (Read Only)
 * |        |          |This bit used to monitor the current status of nCTS pin input.
 * |        |          |0 = nCTS pin input is low level voltage logic state.
 * |        |          |1 = nCTS pin input is high level voltage logic state.
 */
    __IO uint32_t CTL;                   /*!< [0x0000] USCI Control Register                                            */
    __IO uint32_t INTEN;                 /*!< [0x0004] USCI Interrupt Enable Register                                   */
    __IO uint32_t BRGEN;                 /*!< [0x0008] USCI Baud Rate Generator Register                                */
    __I  uint32_t RESERVE0[1];
    __IO uint32_t DATIN0;                /*!< [0x0010] USCI Input Data Signal Configuration Register 0                  */
    __I  uint32_t RESERVE1[3];
    __IO uint32_t CTLIN0;                /*!< [0x0020] USCI Input Control Signal Configuration Register 0               */
    __I  uint32_t RESERVE2[1];
    __IO uint32_t CLKIN;                 /*!< [0x0028] USCI Input Clock Signal Configuration Register                   */
    __IO uint32_t LINECTL;               /*!< [0x002c] USCI Line Control Register                                       */
    __O  uint32_t TXDAT;                 /*!< [0x0030] USCI Transmit Data Register                                      */
    __I  uint32_t RXDAT;                 /*!< [0x0034] USCI Receive Data Register                                       */
    __IO uint32_t BUFCTL;                /*!< [0x0038] USCI Transmit/Receive Buffer Control Register                    */
    __IO uint32_t BUFSTS;                /*!< [0x003c] USCI Transmit/Receive Buffer Status Register                     */
    __IO uint32_t PDMACTL;               /*!< [0x0040] USCI PDMA Control Register                                       */
    __I  uint32_t RESERVE3[4];
    __IO uint32_t WKCTL;                 /*!< [0x0054] USCI Wake-up Control Register                                    */
    __IO uint32_t WKSTS;                 /*!< [0x0058] USCI Wake-up Status Register                                     */
    __IO uint32_t PROTCTL;               /*!< [0x005c] USCI Protocol Control Register                                   */
    __IO uint32_t PROTIEN;               /*!< [0x0060] USCI Protocol Interrupt Enable Register                          */
    __IO uint32_t PROTSTS;               /*!< [0x0064] USCI Protocol Status Register                                    */

} UUART_T;

/**
    @addtogroup UUART_CONST UUART Bit Field Definition
    Constant Definitions for UUART Controller
@{ */

#define UUART_CTL_FUNMODE_Pos         (0)                                            /*!< UUART_T::CTL: FUNMODE Position      */
#define UUART_CTL_FUNMODE_Msk         (0x7ul << UUART_CTL_FUNMODE_Pos)               /*!< UUART_T::CTL: FUNMODE Mask          */

#define UUART_INTEN_TXSTIEN_Pos       (1)                                            /*!< UUART_T::INTEN: TXSTIEN Position    */
#define UUART_INTEN_TXSTIEN_Msk       (0x1ul << UUART_INTEN_TXSTIEN_Pos)             /*!< UUART_T::INTEN: TXSTIEN Mask        */

#define UUART_INTEN_TXENDIEN_Pos      (2)                                            /*!< UUART_T::INTEN: TXENDIEN Position   */
#define UUART_INTEN_TXENDIEN_Msk      (0x1ul << UUART_INTEN_TXENDIEN_Pos)            /*!< UUART_T::INTEN: TXENDIEN Mask       */

