wosayttn/Gerrit_NuMicro/M2003xC_M2003xD_M2003xE_M2003xG_Series/Library/Device/Nuvoton/M2003/Include/uuart_reg.h
#define UUART_BUFCTL_RXRST_Pos        (17)                                           /*!< UUART_T::BUFCTL: RXRST Position     */
#define UUART_BUFCTL_RXRST_Msk        (0x1ul << UUART_BUFCTL_RXRST_Pos)              /*!< UUART_T::BUFCTL: RXRST Mask         */

#define UUART_BUFSTS_RXEMPTY_Pos      (0)                                            /*!< UUART_T::BUFSTS: RXEMPTY Position   */
#define UUART_BUFSTS_RXEMPTY_Msk      (0x1ul << UUART_BUFSTS_RXEMPTY_Pos)            /*!< UUART_T::BUFSTS: RXEMPTY Mask       */

#define UUART_BUFSTS_RXFULL_Pos       (1)                                            /*!< UUART_T::BUFSTS: RXFULL Position    */
#define UUART_BUFSTS_RXFULL_Msk       (0x1ul << UUART_BUFSTS_RXFULL_Pos)             /*!< UUART_T::BUFSTS: RXFULL Mask        */

#define UUART_BUFSTS_RXOVIF_Pos       (3)                                            /*!< UUART_T::BUFSTS: RXOVIF Position    */
#define UUART_BUFSTS_RXOVIF_Msk       (0x1ul << UUART_BUFSTS_RXOVIF_Pos)             /*!< UUART_T::BUFSTS: RXOVIF Mask        */

#define UUART_BUFSTS_TXEMPTY_Pos      (8)                                            /*!< UUART_T::BUFSTS: TXEMPTY Position   */
#define UUART_BUFSTS_TXEMPTY_Msk      (0x1ul << UUART_BUFSTS_TXEMPTY_Pos)            /*!< UUART_T::BUFSTS: TXEMPTY Mask       */

#define UUART_BUFSTS_TXFULL_Pos       (9)                                            /*!< UUART_T::BUFSTS: TXFULL Position    */
#define UUART_BUFSTS_TXFULL_Msk       (0x1ul << UUART_BUFSTS_TXFULL_Pos)             /*!< UUART_T::BUFSTS: TXFULL Mask        */

#define UUART_PDMACTL_PDMARST_Pos     (0)                                               /*!< UUART_T::PDMACTL: PDMARST Position  */
#define UUART_PDMACTL_PDMARST_Msk     (0x1ul << UUART_PDMACTL_PDMARST_Pos)              /*!< UUART_T::PDMACTL: PDMARST Mask      */

#define UUART_PDMACTL_TXPDMAEN_Pos    (1)                                               /*!< UUART_T::PDMACTL: TXPDMAEN Position */
#define UUART_PDMACTL_TXPDMAEN_Msk    (0x1ul << UUART_PDMACTL_TXPDMAEN_Pos)             /*!< UUART_T::PDMACTL: TXPDMAEN Mask     */

#define UUART_PDMACTL_RXPDMAEN_Pos    (2)                                               /*!< UUART_T::PDMACTL: RXPDMAEN Position */
#define UUART_PDMACTL_RXPDMAEN_Msk    (0x1ul << UUART_PDMACTL_RXPDMAEN_Pos)             /*!< UUART_T::PDMACTL: RXPDMAEN Mask     */

#define UUART_PDMACTL_PDMAEN_Pos      (3)                                               /*!< UUART_T::PDMACTL: PDMAEN Position   */
#define UUART_PDMACTL_PDMAEN_Msk      (0x1ul << UUART_PDMACTL_PDMAEN_Pos)               /*!< UUART_T::PDMACTL: PDMAEN Mask       */

#define UUART_WKCTL_WKEN_Pos          (0)                                            /*!< UUART_T::WKCTL: WKEN Position       */
#define UUART_WKCTL_WKEN_Msk          (0x1ul << UUART_WKCTL_WKEN_Pos)                /*!< UUART_T::WKCTL: WKEN Mask           */

#define UUART_WKCTL_PDBOPT_Pos        (2)                                            /*!< UUART_T::WKCTL: PDBOPT Position     */
#define UUART_WKCTL_PDBOPT_Msk        (0x1ul << UUART_WKCTL_PDBOPT_Pos)              /*!< UUART_T::WKCTL: PDBOPT Mask         */

#define UUART_WKSTS_WKF_Pos           (0)                                            /*!< UUART_T::WKSTS: WKF Position        */
#define UUART_WKSTS_WKF_Msk           (0x1ul << UUART_WKSTS_WKF_Pos)                 /*!< UUART_T::WKSTS: WKF Mask            */

#define UUART_PROTCTL_STOPB_Pos       (0)                                            /*!< UUART_T::PROTCTL: STOPB Position    */
#define UUART_PROTCTL_STOPB_Msk       (0x1ul << UUART_PROTCTL_STOPB_Pos)             /*!< UUART_T::PROTCTL: STOPB Mask        */

#define UUART_PROTCTL_PARITYEN_Pos    (1)                                            /*!< UUART_T::PROTCTL: PARITYEN Position */
#define UUART_PROTCTL_PARITYEN_Msk    (0x1ul << UUART_PROTCTL_PARITYEN_Pos)          /*!< UUART_T::PROTCTL: PARITYEN Mask     */

#define UUART_PROTCTL_EVENPARITY_Pos  (2)                                            /*!< UUART_T::PROTCTL: EVENPARITY Position*/
#define UUART_PROTCTL_EVENPARITY_Msk  (0x1ul << UUART_PROTCTL_EVENPARITY_Pos)        /*!< UUART_T::PROTCTL: EVENPARITY Mask   */

#define UUART_PROTCTL_RTSAUTOEN_Pos   (3)                                            /*!< UUART_T::PROTCTL: RTSAUTOEN Position*/
#define UUART_PROTCTL_RTSAUTOEN_Msk   (0x1ul << UUART_PROTCTL_RTSAUTOEN_Pos)         /*!< UUART_T::PROTCTL: RTSAUTOEN Mask    */

#define UUART_PROTCTL_CTSAUTOEN_Pos   (4)                                            /*!< UUART_T::PROTCTL: CTSAUTOEN Position*/
#define UUART_PROTCTL_CTSAUTOEN_Msk   (0x1ul << UUART_PROTCTL_CTSAUTOEN_Pos)         /*!< UUART_T::PROTCTL: CTSAUTOEN Mask    */

#define UUART_PROTCTL_RTSAUDIREN_Pos  (5)                                            /*!< UUART_T::PROTCTL: RTSAUDIREN Position*/
#define UUART_PROTCTL_RTSAUDIREN_Msk  (0x1ul << UUART_PROTCTL_RTSAUDIREN_Pos)        /*!< UUART_T::PROTCTL: RTSAUDIREN Mask   */

#define UUART_PROTCTL_ABREN_Pos       (6)                                            /*!< UUART_T::PROTCTL: ABREN Position    */
#define UUART_PROTCTL_ABREN_Msk       (0x1ul << UUART_PROTCTL_ABREN_Pos)             /*!< UUART_T::PROTCTL: ABREN Mask        */

#define UUART_PROTCTL_DATWKEN_Pos     (9)                                            /*!< UUART_T::PROTCTL: DATWKEN Position  */
#define UUART_PROTCTL_DATWKEN_Msk     (0x1ul << UUART_PROTCTL_DATWKEN_Pos)           /*!< UUART_T::PROTCTL: DATWKEN Mask      */

#define UUART_PROTCTL_CTSWKEN_Pos     (10)                                           /*!< UUART_T::PROTCTL: CTSWKEN Position  */
#define UUART_PROTCTL_CTSWKEN_Msk     (0x1ul << UUART_PROTCTL_CTSWKEN_Pos)           /*!< UUART_T::PROTCTL: CTSWKEN Mask      */

#define UUART_PROTCTL_WAKECNT_Pos     (11)                                           /*!< UUART_T::PROTCTL: WAKECNT Position  */
#define UUART_PROTCTL_WAKECNT_Msk     (0xful << UUART_PROTCTL_WAKECNT_Pos)           /*!< UUART_T::PROTCTL: WAKECNT Mask      */

#define UUART_PROTCTL_BRDETITV_Pos    (16)                                           /*!< UUART_T::PROTCTL: BRDETITV Position */
#define UUART_PROTCTL_BRDETITV_Msk    (0x1fful << UUART_PROTCTL_BRDETITV_Pos)        /*!< UUART_T::PROTCTL: BRDETITV Mask     */

